DataProcessors/Форум_Удалить.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>Форум_Удалить</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>TrayIcon</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийПользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФорумПользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущаяТема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Форум</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ФорумФайлы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ФорумФайлы</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПолноеИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Файл</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоСкачиваний</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Размер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭтоКартинка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Форум.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>Форум</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Пост</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФорумПользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнешняяБаза</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Форум</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФорумПользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ФорумПодписка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ФорумПодписка</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФорумПользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Форум</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/Форум.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>Форум</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФорумПользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторПоследнегоПоста</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФорумПользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоследнегоПоста</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Закрыта</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КартинкаТемы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПостов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПросмотров</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПоследнегоПоста</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоследнийПост</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Прикреплена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаНаОбъект</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СсылкиНаСообщения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тема</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Форум</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номер</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ФорумПользователи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ФорумПользователи</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Аватар</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дополнительно</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайлаАватара</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоСообщений</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подпись</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказыватьУведомленияВТрее</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказыватьУведомления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПосылатьУведомленияПоEmail</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Email</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/Форум_Удалить/Ext/ObjectModule.bsl
Перем HTMLПрилеплена;
Перем HTMLРазделитель;
Перем СписокТем;
Перем ФормаФорум;


Процедура ПроверитьHTMLтемп()
	
	Файл = Новый Файл(КаталогВременныхФайлов() + "\files");
	Если НЕ Файл.Существует() Тогда
		ПолучитьМакет("HTML").Записать(КаталогВременныхФайлов() + "\files.zip");
		ЗИП = Новый ЧтениеZipФайла(КаталогВременныхФайлов() + "\files.zip");
		ЗИП.ИзвлечьВсе(КаталогВременныхФайлов());
	КонецЕсли;

    //
	Файл = Новый Файл(КаталогВременныхФайлов() + "\files\defavatar.jpeg");
	Если НЕ Файл.Существует() Тогда
		БиблиотекаКартинок.NoAvatar.Записать(КаталогВременныхФайлов() + "\files\defavatar.jpeg");
	КонецЕсли;

КонецПроцедуры


Процедура ЗагрузитьКомпоненту() Экспорт
	
	ПутьККаталогуКомпоненты = КаталогВременныхФайлов() + "AddInNetTray";
	
	//
	Попытка
		ПодключитьВнешнююКомпоненту("AddIn.NetTrayComponent");
	Исключение
		КаталогКомпоненты = Новый Файл(ПутьККаталогуКомпоненты);
		Если НЕ КаталогКомпоненты.Существует() Тогда
			СоздатьКаталог(ПутьККаталогуКомпоненты);
		КонецЕсли;
		ФайлКомпоненты = Новый Файл(ПутьККаталогуКомпоненты + "\NetTrayComponent.dll");
		Если НЕ ФайлКомпоненты.Существует() Тогда
			Макет = ПолучитьМакет("NetTrayComponent");
			Макет.Записать(ПутьККаталогуКомпоненты + "\NetTrayComponent.dll");
		КонецЕсли;
		# Если Клиент Тогда
		Попытка
			КомандаСистемы("cmd /C %windir%\Microsoft.NET\Framework\v2.0.50727\RegAsm.exe """ + ПутьККаталогуКомпоненты + "\NetTrayComponent.dll"" /codebase");
			ПодключитьВнешнююКомпоненту("AddIn.NetTrayComponent");
		Исключение
			Сообщить("Невозможно установить компоненту работы с треем !!!", СтатусСообщения.Важное);
			Сообщить("Важно при исталляции (первом запуске) запустить 1С с правами администратора компьютера.", СтатусСообщения.Информация);
			Сообщить("Также важно убедиться, что установлен NET Framework 2.0.50727 %windir%\Microsoft.NET\Framework\", СтатусСообщения.Информация);
			Возврат;
		КонецПопытки;
		# КонецЕсли
	КонецПопытки;
	
	//
	ФайлИконки = Новый Файл(ПутьККаталогуКомпоненты + "\icon.ico");
	Если НЕ ФайлИконки.Существует() Тогда
		Макет = ПолучитьМакет("Icon");
		КаталогКомпоненты = Новый Файл(ПутьККаталогуКомпоненты);
		Если НЕ КаталогКомпоненты.Существует() Тогда
			СоздатьКаталог(ПутьККаталогуКомпоненты);
		КонецЕсли;
		Макет.Записать(ПутьККаталогуКомпоненты + "\icon.ico");
	КонецЕсли;

	TrayIcon = Новый("AddIn.NetTrayComponent", Неопределено);
	TrayIcon.IconFilePath = ПутьККаталогуКомпоненты + "\icon.ico";
	TrayIcon.ShowTrayIcon(Истина);

	//
	# Если Клиент Тогда
	ПодключитьОбработчикОжидания("УведомленияТрея", 10);
	# КонецЕсли

КонецПроцедуры

Процедура ОткрытьФормуФорума() Экспорт
	
	ФормаФорум = ЭтотОбъект.ПолучитьФорму("Форум",, "Phorum");
	Если ФормаФорум.Открыта() Тогда
		ФормаФорум.Открыть();
	КонецЕсли;
	ФормаФорум.Открыть();

КонецПроцедуры


Процедура Инициализация() Экспорт
	
	ПроверитьHTMLтемп();
	
	Если РольДоступна("АК_РаботаСФорумом") Тогда
		
		ФормаФорум = ЭтотОбъект.ПолучитьФорму("Форум",, "Phorum");
		ТекущийПользователь = ФормаФорум.ПолучитьТекущегоПользователя();

		Если ТекущийПользователь.ПоказыватьУведомленияВТрее Тогда
			ЗагрузитьКомпоненту();
		КонецЕсли;

		ОткрытьФормуФорума();
		
	КонецЕсли;

КонецПроцедуры

Процедура СохранитьНастройки(АдресSMTPСервера, ПортSMTP, ПользовательSMTP, ПарольSMTP, АутентификацияSMTP) Экспорт
	
	ЗначениеВФайл(КаталогВременныхФайлов() + "tmp79.tmp",
					Новый Структура("АдресSMTPСервера, ПортSMTP, ПользовательSMTP, ПарольSMTP, АутентификацияSMTP",
									АдресSMTPСервера, ПортSMTP, ПользовательSMTP, ПарольSMTP, АутентификацияSMTP));
	
	Запись = РегистрыСведений.ФорумФайлы.СоздатьМенеджерЗаписи();
	Запись.ИмяФайла = "ПараметрыПочты";
	Запись.Файл 	= Новый ХранилищеЗначения(Новый ДвоичныеДанные(КаталогВременныхФайлов() + "tmp79.tmp"));
	Запись.Записать();
	
	УдалитьФайлы(КаталогВременныхФайлов() + "tmp79.tmp");
	
КонецПроцедуры

Функция ПолучитьНастройки() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ФорумФайлы.ИмяФайла,
	|	ФорумФайлы.Файл
	|ИЗ
	|	РегистрСведений.ФорумФайлы КАК ФорумФайлы
	|ГДЕ
	|	ФорумФайлы.ИмяФайла = ""ПараметрыПочты""";

	ТЗ = Запрос.Выполнить().Выгрузить();
	Если НЕ ТЗ.Количество() Тогда
		Возврат Неопределено;
	КонецЕсли;
	Попытка
		ТЗ[0].Файл.Получить().Записать(КаталогВременныхФайлов() + "tmp79.tmp");
	Исключение
		Возврат Неопределено;
	КонецПопытки;

	Возврат ЗначениеИзФайла(КаталогВременныхФайлов() + "tmp79.tmp");

КонецФункции


Функция ОтправитьИзвещениеПочтойИнтернет(П)
	
	Перем АдресSMTPСервера, ПортSMTP, ПользовательSMTP, ПарольSMTP, АутентификацияSMTP;
	
	Умолчания = ПолучитьНастройки();
	Если Умолчания = Неопределено Тогда
		П.Вставить("Ошибка"			, Истина);
		П.Вставить("ОписаниеОшибки"	, "Не заполнены параметры поключения к SMTP");
		Возврат Ложь;
	КонецЕсли;

	Если Не П.Свойство("АдресSMTPСервера", АдресSMTPСервера) Тогда
		АдресSMTPСервера = Умолчания.АдресSMTPСервера;
	КонецЕсли;
	Если Не П.Свойство("ПортSMTP", ПортSMTP) Тогда
		ПортSMTP = Умолчания.ПортSMTP;
	КонецЕсли;
	Если Не П.Свойство("ПользовательSMTP", ПользовательSMTP) Тогда
		ПользовательSMTP = Умолчания.ПользовательSMTP;
	КонецЕсли;
	Если Не П.Свойство("ПарольSMTP", ПарольSMTP) Тогда
		ПарольSMTP = Умолчания.ПарольSMTP;
	КонецЕсли;
	Если Не П.Свойство("АутентификацияSMTP", АутентификацияSMTP) Тогда
		АутентификацияSMTP = Умолчания.АутентификацияSMTP;
	КонецЕсли;

	ИнтернетПочта = Новый ИнтернетПочта;
	Профиль = Новый ИнтернетПочтовыйПрофиль;
	Профиль.АдресСервераSMTP = АдресSMTPСервера;
	Профиль.ПортSMTP = ПортSMTP;
	Если АутентификацияSMTP Тогда
		Профиль.ПользовательSMTP = ПользовательSMTP;
		Профиль.ПарольSMTP = ПарольSMTP;
	КонецЕсли;

	Если Не П.Свойство("Получатели") Тогда
		П.Вставить("Ошибка", Истина);
		П.Вставить("ОписаниеОшибки", "Не указан получатель");
		Возврат Ложь;
	КонецЕсли;
	Если ТипЗнч(П.Получатели) = Тип("Массив") Тогда
		Получатели = П.Получатели;
	Иначе
		Получатели = Новый Массив;
		Получатели.Добавить(П.Получатели);
	КонецЕсли;

	Если П.Свойство("Копии") Тогда
		Если ТипЗнч(П.Копии) = Тип("Массив") Тогда
			Копии = П.Копии;
		Иначе
			Копии = Новый Массив;
			Копии.Добавить(П.Копии);
		КонецЕсли;
	КонецЕсли;


	Если П.Свойство("Тема") Тогда
		Тема = П.Тема;
	Иначе
		Тема = "Без темы";
	КонецЕсли;

	Если П.Свойство("Текст") Тогда
		Текст = П.Текст;
	Иначе
		Текст = Неопределено;
	КонецЕсли;

	Если П.Свойство("ТипТекста") Тогда
		ТипТекста = П.ТипТекста;
	Иначе
		ТипТекста = ТипТекстаПочтовогоСообщения.HTML;
	КонецЕсли;

	Если П.Свойство("ИмяОтправителя") Тогда
		ИмяОтправителя = П.ИмяОтправителя;
	Иначе
		ИмяОтправителя = "Робот";
	КонецЕсли;

	Если П.Свойство("Отправитель") Тогда
		Отправитель = П.Отправитель;
	Иначе
		Отправитель = ПользовательSMTP + "@" + АдресSMTPСервера;
	КонецЕсли;

	Если Не П.Свойство("Вложения") Тогда
		Вложения = Новый Массив;
	Иначе
		Если ТипЗнч(П.Получатели) = Тип("Массив") Тогда
			Вложения = П.Вложения;
		Иначе
			Вложения = Новый Массив;
			Вложения.Добавить(П.Вложения);
		КонецЕсли;
	КонецЕсли;


	Попытка
		ИнтернетПочта.Подключиться(Профиль);
		Сообщение = Новый ИнтернетПочтовоеСообщение;
		Сообщение.Тема = Тема;
		Для каждого Получатель Из Получатели Цикл
			Сообщение.Получатели.Добавить(Получатель);
		КонецЦикла;
		Если П.Свойство("Копии") Тогда
			Для каждого Копия Из Копии Цикл
				Сообщение.Копии.Добавить(Копия);
			КонецЦикла;
		КонецЕсли;
		Сообщение.ИмяОтправителя = ИмяОтправителя;
		Сообщение.Отправитель 	= Отправитель;
		Для каждого Вложение Из Вложения Цикл
			Сообщение.Вложения.Добавить(Вложение);
		КонецЦикла;
		Если Текст <> Неопределено Тогда
			Сообщение.Тексты.Добавить(Текст, ТипТекста);
		КонецЕсли;
		ИнтернетПочта.Послать(Сообщение);
		ИнтернетПочта.Отключиться();
		П.Вставить("Ошибка", Ложь);
		Возврат Истина;
	Исключение
		ОписаниеОшибки = ОписаниеОшибки();
		П.Вставить("Ошибка", Истина);
		П.Вставить("ОписаниеОшибки", ОписаниеОшибки);
		Возврат Ложь;
	КонецПопытки;
	
КонецФункции

Процедура ОтправитьИзвещениеПочтой(Пользователь) Экспорт
	
	Если ЗначениеЗаполнено(ТекущийПользователь.Email) Тогда
		Возврат;
	КонецЕсли;

КонецПроцедуры

Процедура ОбновитьСписокТемРаздела(Тема, ЭлементыФормы) Экспорт
	
	//
	ТемыФорумаЗапрос = Новый Запрос;
	ТемыФорумаЗапрос.УстановитьПараметр("Тема", Тема);
	ТемыФорумаЗапрос.Текст =
	"ВЫБРАТЬ
	|	Форум.Код,
	|	Форум.Наименование,
	|	Форум.АвторПоследнегоПоста.Наименование КАК АвторПоследнегоПоста,
	|	Форум.Автор.Наименование КАК Автор,
	|	Форум.ДатаПоследнегоПоста КАК ДатаПоследнегоПоста,
	|	Форум.Закрыта,
	|	Форум.КоличествоПостов,
	|	Форум.КоличествоПросмотров,
	|	Форум.Описание,
	|	Форум.ПоследнийПост,
	|	Форум.КартинкаТемы,
	|	ЕСТЬNULL(Форум.Прикреплена, ЛОЖЬ) КАК Прикреплена
	|ИЗ
	|	Справочник.Форум КАК Форум
	|ГДЕ
	|	Форум.Родитель = &Тема
	|	И НЕ Форум.ЭтоГруппа
	|
	|УПОРЯДОЧИТЬ ПО
	|	Прикреплена УБЫВ,
	|	ДатаПоследнегоПоста УБЫВ";
	ТаблицаЗапроса = ТемыФорумаЗапрос.Выполнить().Выгрузить();
	
	МакетФорума 		= Обработки.Форум.ПолучитьМакет("ШаблонСписокТем");
	ШаблонФорума 		= МакетФорума.ПолучитьТекст();
	
	МакетТемыФорума 	= Обработки.Форум.ПолучитьМакет("ШаблонТема");
	ШаблонТемыФорума 	= МакетТемыФорума.ПолучитьТекст();

	ХТМЛТем = "";

	ПервыйПроход = Истина;
	ВыводитьРазделитель = Ложь;

	Для каждого СтрТема Из ТаблицаЗапроса Цикл

		Если ПервыйПроход
				И СтрТема.Прикреплена Тогда
			ВыводитьРазделитель = Истина;
		КонецЕсли;
		Если ПервыйПроход Тогда
			ПервыйПроход = Ложь;
		КонецЕсли;
		Если ВыводитьРазделитель
				И Не СтрТема.Прикреплена Тогда
			ХТМЛТем = ХТМЛТем + HTMLРазделитель;
			ВыводитьРазделитель = Ложь;
		КонецЕсли;

		Если СтрТема.Прикреплена Тогда
			ХТМЛТема = СтрЗаменить(ШаблонТемыФорума, "%Прилеплена%", HTMLПрилеплена);
		Иначе
			ХТМЛТема = СтрЗаменить(ШаблонТемыФорума, "%Прилеплена%", "");
		КонецЕсли;
		ХТМЛТема = СтрЗаменить(ХТМЛТема, "%КодТемы%"					, СтрТема.Код);
		ХТМЛТема = СтрЗаменить(ХТМЛТема, "%ТекстТемы%"					, СтрТема.Описание);
		ХТМЛТема = СтрЗаменить(ХТМЛТема, "%ДатаПоследнегоПоста%"		, СтрТема.ДатаПоследнегоПоста);
		ХТМЛТема = СтрЗаменить(ХТМЛТема, "%ЗаголовокТемы%"				, СтрТема.Наименование);
		ХТМЛТема = СтрЗаменить(ХТМЛТема, "%КартинкаТемы%"				, СтрТема.КартинкаТемы);
		ХТМЛТема = СтрЗаменить(ХТМЛТема, "%АвторПоста%"					, СтрТема.Автор);
		ХТМЛТема = СтрЗаменить(ХТМЛТема, "%АвторПоследнегоПоста%"		, СтрТема.АвторПоследнегоПоста);
		ХТМЛТема = СтрЗаменить(ХТМЛТема, "%Ответов%"					, СтрТема.КоличествоПостов);
		ХТМЛТема = СтрЗаменить(ХТМЛТема, "%Просмотров%"					, СтрТема.КоличествоПросмотров);
		ХТМЛТема = СтрЗаменить(ХТМЛТема, "%КодПользователя%"			, СтрТема.Автор);
		ХТМЛТема = СтрЗаменить(ХТМЛТема, "%КодПоследнегоПользователя%"	, СтрТема.АвторПоследнегоПоста);
		Если СтрТема.Закрыта Тогда
			ХТМЛТема = СтрЗаменить(ХТМЛТема, "thread_h.gif"				, "thread_l.gif");
		КонецЕсли;
		ХТМЛТема = СтрЗаменить(ХТМЛТема, "%КаталогФорума%"				, КаталогВременныхФайлов());
		ХТМЛТем = ХТМЛТем + ХТМЛТема;

	КонецЦикла;
	ХТМЛ = СтрЗаменить(ШаблонФорума, "%КаталогФорума%", КаталогВременныхФайлов());
	ХТМЛ = СтрЗаменить(ХТМЛ, "%Темы%", ХТМЛТем);
	
	ХТМЛФайл = Новый ЗаписьТекста(КаталогВременныхФайлов() + "files\tempphorum" + Тема.Код + ".html");
	ХТМЛФайл.Записать(ХТМЛ);
	ХТМЛФайл.Закрыть();

	ЭлементыФормы.ПолеHTMLДокумента1.Перейти(КаталогВременныхФайлов() + "files\tempphorum" + Тема.Код + ".html");

КонецПроцедуры

Функция ТекущийПользовательАдмин() Экспорт
	
	ФормаФорум = ЭтотОбъект.ПолучитьФорму("Форум", , "Phorum");
	
	Возврат ФормаФорум.Админ();
	
КонецФункции

Процедура ВывестиТему(Тема, ЭлементыФормы) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка"		, Тема);
	Запрос.УстановитьПараметр("ТекущаяДата"	, ТекущаяДата());
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ФорумСрезПоследних.Период КАК Период,
	|	ФорумСрезПоследних.Автор.Ссылка КАК Автор,
	|	ФорумСрезПоследних.Тема.Ссылка КАК Тема,
	|	ФорумСрезПоследних.Пост КАК Пост,
	|	ФорумСрезПоследних.Номер
	|ИЗ
	|	РегистрСведений.Форум.СрезПоследних(&ТекущаяДата, ) КАК ФорумСрезПоследних
	|ГДЕ
	|	ФорумСрезПоследних.Тема.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номер";
	ТЗ = Запрос.Выполнить().Выгрузить();

	ФайлыФорумаЗапрос = Новый Запрос("ВЫБРАТЬ
	|	ФорумФайлы.Номер,
	|	ФорумФайлы.ЭтоКартинка,
	|	ФорумФайлы.ИмяФайла,
	|	ФорумФайлы.ПолноеИмяФайла,
	|	ФорумФайлы.Файл,
	|	ФорумФайлы.КоличествоСкачиваний,
	|	ФорумФайлы.Размер
	|ИЗ
	|	РегистрСведений.ФорумФайлы КАК ФорумФайлы
	|ГДЕ
	|	ФорумФайлы.Объект = &Ссылка
	|	И ФорумФайлы.Объект ССЫЛКА Справочник.Форум");
	ФайлыФорумаЗапрос.УстановитьПараметр("Ссылка", Тема);
	ТЗФайлыФорума = ФайлыФорумаЗапрос.Выполнить().Выгрузить();
	ТЗФайлыФорума.Индексы.Добавить("Номер");

	МакетФорума 		= Обработки.Форум.ПолучитьМакет("Шаблон");
	МакетПостаФорума 	= Обработки.Форум.ПолучитьМакет("ШаблонПоста");
	ШаблонФорума 		= МакетФорума.ПолучитьТекст();
	ШаблонПостаФорума 	= МакетПостаФорума.ПолучитьТекст();

	МассивПодключений = ПолучитьСоединенияИнформационнойБазы();
	Пользователи = "";
	Для каждого СтрМасива Из МассивПодключений Цикл
		Если СтрМасива.ИмяПриложения = "1CV8" Тогда
			Пользователи = Пользователи + "," + СтрМасива.Пользователь.Имя;
		КонецЕсли;
	КонецЦикла;

	ХТМЛПостов = "";
	НомерПоста1 = 0;

	НомерПоста1 = НомерПоста1 + 1;
	Попытка
		ПользовательНайден = Найти(Пользователи, Тема.Автор.Наименование);
	Исключение
		ПользовательНайден = 0;
	КонецПопытки;
	СтатусОнлайн = ?(ПользовательНайден, "useron", "useroff");

	ТекстТемы = Тема.Описание;

	МассивФайлов = ТЗФайлыФорума.НайтиСтроки(Новый Структура("Номер", 0));
	Для каждого ФайлПоста Из МассивФайлов Цикл
		Если ФайлПоста.ЭтоКартинка Тогда
			ИмяЗамены = "#IMG_" + ФайлПоста.ИмяФайла + "#";
			Нашли = Найти(ТекстТемы, ИмяЗамены);
			Если Нашли Тогда

				ФайлКартинки = Новый Файл(КаталогВременныхФайлов() + "\files\" + ФайлПоста.ПолноеИмяФайла);
				Если Не ФайлКартинки.Существует() Тогда
					Попытка
						ФайлПоста.Файл.Получить().Записать(КаталогВременныхФайлов() + "\files\" + ФайлПоста.ПолноеИмяФайла);
					Исключение

					КонецПопытки;
				КонецЕсли;

				ТекстТемы = СтрЗаменить(ТекстТемы, ИмяЗамены, "<img src=""files/" + ФайлПоста.ПолноеИмяФайла + """  border=""0"" />");
			КонецЕсли;
		КонецЕсли;
		ИмяЗамены = "#FILE_" + ФайлПоста.ИмяФайла + "#";
		Нашли = Найти(ТекстТемы, ИмяЗамены);
		Если Нашли Тогда

			ТекстТемы = СтрЗаменить(ТекстТемы, ИмяЗамены, "<strong style=""font-size:0.9em"">Файл: </strong><a href=""file"" id=""PhorumFile_" + 0 + "_" + ФайлПоста.ИмяФайла + """>" + ФайлПоста.ИмяФайла + "</a>" + " размер: " + ФайлПоста.Размер + " b. " + " количество скачиваний: " + ФайлПоста.КоличествоСкачиваний);
		КонецЕсли;
	КонецЦикла;

	ХТМЛПост = СтрЗаменить(ШаблонПостаФорума, "%Пост%", ТекстТемы);

	ХТМЛЗвездочка = "<IMG alt=* src=""files/staradmin.gif"" border=0>";

	Админ = ТекущийПользовательАдмин();

	Если Админ Тогда
		КоличествоЗвезд = 7;
	Иначе
		Если Тема.Автор.КоличествоСообщений / 100 < 1 Тогда
			КоличествоЗвезд = 1;
		ИначеЕсли Тема.Автор.КоличествоСообщений / 100 < 2 Тогда
			КоличествоЗвезд = 2;
		ИначеЕсли Тема.Автор.КоличествоСообщений / 100 < 3 Тогда
			КоличествоЗвезд = 3;
		ИначеЕсли Тема.Автор.КоличествоСообщений / 100 < 4 Тогда
			КоличествоЗвезд = 4;
		Иначе
			КоличествоЗвезд = 5;
		КонецЕсли;
	КонецЕсли;
	ХТМЛЗвезд = "";
	Для з = 1 По КоличествоЗвезд Цикл
		ХТМЛЗвезд = ХТМЛЗвезд + ХТМЛЗвездочка;
	КонецЦикла;
	ХТМЛПост = СтрЗаменить(ХТМЛПост, "%РейтингСообщений%"			, ХТМЛЗвезд);

	ХТМЛПост = СтрЗаменить(ХТМЛПост, "%НомерОтветаФорум%"			, НомерПоста1);
	ХТМЛПост = СтрЗаменить(ХТМЛПост, "%ДатаОтветаФорум%"			, Формат(Тема.ДатаСоздания, "ДЛФ=DDT"));
	ХТМЛПост = СтрЗаменить(ХТМЛПост, "%КоличествоСообщенийФорум%"	, Тема.Автор.КоличествоСообщений);
	ХТМЛПост = СтрЗаменить(ХТМЛПост, "%ЮзерОнлайнФорум%"			, ?(ПользовательНайден, "Онлайн", "Офлайн"));
	ХТМЛПост = СтрЗаменить(ХТМЛПост, "%ЮзерОнлайКартинкаФорум%"		, СтатусОнлайн);
	ХТМЛПост = СтрЗаменить(ХТМЛПост, "%Автор%"						, Тема.Автор.Код);
	ХТМЛПост = СтрЗаменить(ХТМЛПост, "%Подразделение%"				, Тема.Автор.Подразделение);
	ХТМЛПост = СтрЗаменить(ХТМЛПост, "%Должность%"					, Тема.Автор.Должность);
	ХТМЛПост = СтрЗаменить(ХТМЛПост, "%Тема%"						, Тема.Наименование);
	ХТМЛПост = СтрЗаменить(ХТМЛПост, "%Подпись%"					, Тема.Автор.Подпись);
	ХТМЛПост = СтрЗаменить(ХТМЛПост, "%КодПользователя%"			, Тема.Автор.Наименование);
	Если СокрЛП(Тема.Автор.ИмяФайлаАватара) = "" Тогда
		ХТМЛПост = СтрЗаменить(ХТМЛПост, "%ИмяФайлаКартинки%"		, "defavatar.jpeg");
	Иначе
		ХТМЛПост = СтрЗаменить(ХТМЛПост, "%ИмяФайлаКартинки%"		, Тема.Автор.ИмяФайлаАватара);
	КонецЕсли;
	ХТМЛПост = СтрЗаменить(ХТМЛПост, "%Фон%"						, ?(Цел(НомерПоста1 / 2) = НомерПоста1 / 2, "2", ""));

	ХТМЛПостов = ХТМЛПостов + ХТМЛПост;

	Для каждого Пост Из ТЗ Цикл

		Тема1 = "RE:" + Пост.Тема;
		НомерПоста1 = НомерПоста1 + 1;
		Попытка
			ПользовательНайден = Найти(Пользователи, Пост.Автор.Наименование);
		Исключение
			ПользовательНайден = 0;
		КонецПопытки;
		СтатусОнлайн = ?(ПользовательНайден, "useron", "useroff");


		МассивФайлов = ТЗФайлыФорума.НайтиСтроки(Новый Структура("Номер", Пост.Номер));
		Для каждого ФайлПоста Из МассивФайлов Цикл
			Если ФайлПоста.ЭтоКартинка Тогда
				ИмяЗамены = "#IMG_" + ФайлПоста.ИмяФайла + "#";
				Нашли = Найти(Пост.Пост, ИмяЗамены);
				Если Нашли Тогда

					ФайлКартинки = Новый Файл(КаталогВременныхФайлов() + "\files\" + ФайлПоста.ПолноеИмяФайла);
					Если Не ФайлКартинки.Существует() Тогда
						Попытка
							ФайлПоста.Файл.Получить().Записать(КаталогВременныхФайлов() + "\files\" + ФайлПоста.ПолноеИмяФайла);
						Исключение

						КонецПопытки;
					КонецЕсли;

					Пост.Пост = СтрЗаменить(Пост.Пост, ИмяЗамены, "<img src=""files/" + ФайлПоста.ПолноеИмяФайла + """  border=""0"" />");
				КонецЕсли;
			КонецЕсли;
			ИмяЗамены = "#FILE_" + ФайлПоста.ИмяФайла + "#";
			Нашли = Найти(Пост.Пост, ИмяЗамены);
			Если Нашли Тогда

				Пост.Пост = СтрЗаменить(Пост.Пост, ИмяЗамены, "<strong style=""font-size:0.9em"">Файл: </strong><a href=""file"" id=""PhorumFile_" + Пост.Номер + "_" + ФайлПоста.ИмяФайла + """>" + ФайлПоста.ИмяФайла + "</a>" + "   Размер: " + ФайлПоста.Размер + " b. " + "   Количество скачиваний: " + ФайлПоста.КоличествоСкачиваний);
			КонецЕсли;
		КонецЦикла;

		ХТМЛПост = СтрЗаменить(ШаблонПостаФорума, "%Пост%", Пост.Пост);

		Админ = ТекущийПользовательАдмин();


		Если Админ Тогда
			КоличествоЗвезд = 7;
		Иначе
			Если Пост.Автор.КоличествоСообщений / 100 > 1 Тогда
				КоличествоЗвезд = 1;
			ИначеЕсли Пост.Автор.КоличествоСообщений / 100 > 2 Тогда
				КоличествоЗвезд = 2;
			ИначеЕсли Пост.Автор.КоличествоСообщений / 100 > 3 Тогда
				КоличествоЗвезд = 3;
			ИначеЕсли Пост.Автор.КоличествоСообщений / 100 > 4 Тогда
				КоличествоЗвезд = 4;
			Иначе
				КоличествоЗвезд = 5;
			КонецЕсли;
		КонецЕсли;
		ХТМЛЗвезд = "";
		Для з = 1 По КоличествоЗвезд Цикл
			ХТМЛЗвезд = ХТМЛЗвезд + ХТМЛЗвездочка;
		КонецЦикла;
		ХТМЛПост = СтрЗаменить(ХТМЛПост, "%РейтингСообщений%"			, ХТМЛЗвезд);

		ХТМЛПост = СтрЗаменить(ХТМЛПост, "%НомерОтветаФорум%"			, НомерПоста1);
		ХТМЛПост = СтрЗаменить(ХТМЛПост, "%ДатаОтветаФорум%"			, Формат(Пост.Период, "ДЛФ=DDT"));
		ХТМЛПост = СтрЗаменить(ХТМЛПост, "%КоличествоСообщенийФорум%"	, Пост.Автор.КоличествоСообщений);
		ХТМЛПост = СтрЗаменить(ХТМЛПост, "%ЮзерОнлайнФорум%"			, ?(ПользовательНайден, "Онлайн", "Офлайн"));
		ХТМЛПост = СтрЗаменить(ХТМЛПост, "%ЮзерОнлайКартинкаФорум%"		, СтатусОнлайн);
		ХТМЛПост = СтрЗаменить(ХТМЛПост, "%Автор%"						, Пост.Автор);
		ХТМЛПост = СтрЗаменить(ХТМЛПост, "%Подразделение%"				, Пост.Автор.Подразделение);
		ХТМЛПост = СтрЗаменить(ХТМЛПост, "%Должность%"					, Пост.Автор.Должность);
		ХТМЛПост = СтрЗаменить(ХТМЛПост, "%Тема%"						, Тема1);
		ХТМЛПост = СтрЗаменить(ХТМЛПост, "%Подпись%"					, Пост.Автор.Подпись);
		ХТМЛПост = СтрЗаменить(ХТМЛПост, "%КодПользователя%"			, Пост.Автор.Наименование);
		Если СокрЛП(Пост.Автор.ИмяФайлаАватара) = "" Тогда
			ХТМЛПост = СтрЗаменить(ХТМЛПост, "%ИмяФайлаКартинки%"		, "defavatar.jpeg");
		Иначе
			ХТМЛПост = СтрЗаменить(ХТМЛПост, "%ИмяФайлаКартинки%"		, Пост.Автор.ИмяФайлаАватара);
		КонецЕсли;
		ХТМЛПост = СтрЗаменить(ХТМЛПост, "%Фон%"						, ?(Цел(НомерПоста1 / 2) = НомерПоста1 / 2, "2", ""));

		ХТМЛПостов = ХТМЛПостов + ХТМЛПост;

		ПоследнийПост = Пост.Номер;
	КонецЦикла;
	ХТМЛ = СтрЗаменить(ШаблонФорума	, "%КаталогФорума%"	, КаталогВременныхФайлов());
	ХТМЛ = СтрЗаменить(ХТМЛ			, "%Посты%"			, ХТМЛПостов);

	Если ЗначениеЗаполнено(Тема.СсылкаНаОбъект) Тогда
		ХТМЛ = СтрЗаменить(ХТМЛ	, "%ИДОбъкта%", "TemaObj_" + Тема.Код);
	Иначе
		ХТМЛ = СтрЗаменить(ХТМЛ	, "%ИДОбъкта%", "");
	КонецЕсли;

	ХТМЛ = СтрЗаменить(ХТМЛ		, "%ИмяФайла%", КаталогВременныхФайлов() + "files\temptopik" + Тема.Код + ".html");
	ХТМЛФайл = Новый ЗаписьТекста(КаталогВременныхФайлов() + "files\temptopik" + Тема.Код + ".html");
	ХТМЛФайл.Записать(ХТМЛ);
	ХТМЛФайл.Закрыть();


	ЭлементыФормы.ПолеHTMLДокумента1.Перейти(КаталогВременныхФайлов() + "files\temptopik" + Тема.Код + ".html");


	ТемаОб = Тема.ПолучитьОбъект();
	ТемаОб.КоличествоПросмотров = ТемаОб.КоличествоПросмотров + 1;
	ТемаОб.Записать();

	Авторы = Новый СписокЗначений;
	Авторы.ЗагрузитьЗначения(ТЗ.ВыгрузитьКолонку("Автор"));
	Авторы.Добавить(Тема.Автор);


	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Авторы", Авторы);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ФорумПользователи.Ссылка,
	|	ФорумПользователи.ИмяФайлаАватара,
	|	ФорумПользователи.Аватар
	|ИЗ
	|	Справочник.ФорумПользователи КАК ФорумПользователи
	|ГДЕ
	|	ФорумПользователи.ИмяФайлаАватара <> """"
	|	И ФорумПользователи.Ссылка В(&Авторы)";
	ТЗ = Запрос.Выполнить().Выгрузить();

	Для каждого Стр Из ТЗ Цикл
		ФайлАватара = Новый Файл(КаталогВременныхФайлов() + "\files\" + Стр.ИмяФайлаАватара);
		Если НЕ ФайлАватара.Существует() Тогда
			Попытка
				Стр.Аватар.Получить().Записать(КаталогВременныхФайлов() + "\files\" + Стр.ИмяФайлаАватара);
			Исключение

			КонецПопытки;
		КонецЕсли;
	КонецЦикла;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Тема"		, Тема);
	Запрос.УстановитьПараметр("Пользователь", ЭтотОбъект.ТекущийПользователь);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ФорумПодписка.Номер
	|ИЗ
	|	РегистрСведений.ФорумПодписка КАК ФорумПодписка
	|ГДЕ
	|	ФорумПодписка.Тема = &Тема
	|	И ФорумПодписка.Пользователь = &Пользователь";

	ТЗ = Запрос.Выполнить().Выгрузить();
	Если ТЗ.Количество() Тогда
		Запись = РегистрыСведений.ФорумПодписка.СоздатьМенеджерЗаписи();
		Запись.Пользователь = ЭтотОбъект.ТекущийПользователь;
		Запись.Тема 		= Тема;
		Запись.Номер 		= ПоследнийПост;
		Запись.Записать();
	КонецЕсли;

    //
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Тема"		, Тема);
	Запрос.УстановитьПараметр("Пользователь", ЭтотОбъект.ТекущийПользователь);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ФорумУведомления.Ссылка
	|ИЗ
	|	Задача.ФорумУведомления КАК ФорумУведомления
	|ГДЕ
	|	ФорумУведомления.Выполнена = ЛОЖЬ
	|	И ФорумУведомления.Тема = &Тема
	|	И ФорумУведомления.Пользователь = &Пользователь";
	ТЗ = Запрос.Выполнить().Выгрузить();

	Для каждого СтрокаТаблицы Из ТЗ Цикл

		ЗадачаОб = СтрокаТаблицы.Ссылка.ПолучитьОбъект();
		ЗадачаОб.ВыполнитьЗадачу();

	КонецЦикла;

КонецПроцедуры

Процедура СформироватьУведомления() Экспорт
	
	//
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Тема"				, ЭтотОбъект.ТекущаяТема);
	Запрос.УстановитьПараметр("ТекущийПользователь"	, ЭтотОбъект.ТекущийПользователь);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ФорумПодписка.Пользователь,
	|	ФорумПодписка.Номер
	|ПОМЕСТИТЬ Подписка
	|ИЗ
	|	РегистрСведений.ФорумПодписка КАК ФорумПодписка
	|ГДЕ
	|	ФорумПодписка.Тема = &Тема
	|	И ФорумПодписка.Пользователь <> &ТекущийПользователь
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ФорумУведомления.Пользователь,
	|	МАКСИМУМ(ФорумУведомления.НомерПоста) КАК НомерПоста
	|ПОМЕСТИТЬ Уведомления
	|ИЗ
	|	Задача.ФорумУведомления КАК ФорумУведомления
	|ГДЕ
	|	ФорумУведомления.Тема = &Тема
	|	И ФорумУведомления.Выполнена = ЛОЖЬ
	|
	|СГРУППИРОВАТЬ ПО
	|	ФорумУведомления.Пользователь
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Подписка.Пользователь,
	|	Подписка.Номер КАК ПоследнийПросмотр,
	|	Уведомления.НомерПоста КАК ПоследнееУведомление
	|ИЗ
	|	Подписка КАК Подписка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Уведомления КАК Уведомления
	|		ПО Подписка.Пользователь = Уведомления.Пользователь";

	П = Новый Структура("Получатели, Тема, Текст, ТипТекста");
	МассПолучатели = Новый Массив;
	ТЗ = Запрос.Выполнить().Выгрузить();
	Для каждого Строка Из ТЗ Цикл
		Если Строка.ПоследнееУведомление <> Null Тогда
			Продолжить;
		КонецЕсли;
		Если Строка.Пользователь.ПосылатьУведомленияПоEmail Тогда
			Если ЗначениеЗаполнено(Строка.Пользователь.Email) Тогда
				МассПолучатели.Добавить(Строка.Пользователь.Email);
			КонецЕсли;
		КонецЕсли;
		Задача = Задачи.ФорумУведомления.СоздатьЗадачу();
		Задача.Новая 		= Истина;
		Задача.Пользователь = Строка.Пользователь;
		Задача.Тема 		= ЭтотОбъект.ТекущаяТема;
		Задача.Наименование = "Ответ в теме " + ЭтотОбъект.ТекущаяТема.Наименование + " сделал пользователь " + 
								ЭтотОбъект.ТекущаяТема.АвторПоследнегоПоста + " дата " + ЭтотОбъект.ТекущаяТема.ДатаПоследнегоПоста;
		Задача.НомерПоста 	= ЭтотОбъект.ТекущаяТема.НомерПоследнегоПоста;
		Задача.Дата 		= ТекущаяДата();
		Задача.Записать();
	КонецЦикла;

	П.Получатели 	= МассПолучатели;
	П.Тема 			= "Уведомление форума";
	П.Текст 		= "Ответ в теме " + ЭтотОбъект.ТекущаяТема.Наименование + " сделал пользователь " + ЭтотОбъект.ТекущаяТема.АвторПоследнегоПоста +
						" дата " + ЭтотОбъект.ТекущаяТема.ДатаПоследнегоПоста;
	П.ТипТекста 	= ТипТекстаПочтовогоСообщения.ПростойТекст;
	ОтправитьИзвещениеПочтойИнтернет(П);

КонецПроцедуры

Процедура СформироватьУведомленияТрея() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ФорумУведомления.Ссылка
	|ИЗ
	|	Задача.ФорумУведомления КАК ФорумУведомления
	|ГДЕ
	|	ФорумУведомления.Пользователь = &Пользователь
	|	И ФорумУведомления.Выполнена = ЛОЖЬ
	|	И ФорумУведомления.Новая = ИСТИНА
	|
	|УПОРЯДОЧИТЬ ПО
	|	ФорумУведомления.Дата";
	Запрос.УстановитьПараметр("Пользователь", ТекущийПользователь);
	ТЗ = Запрос.Выполнить().Выгрузить();
	Если Не ТЗ.Количество() Тогда
		Возврат;
	КонецЕсли;
	ДанныеСтроки = ТЗ[0];
	
	Задача = ДанныеСтроки.Ссылка.ПолучитьОбъект();
	Если Задача <> Неопределено Тогда
		Задача.Новая = Ложь;
		Задача.Записать();
	КонецЕсли;

	Если ТекущийПользователь.ПоказыватьУведомленияВТрее Тогда
		Попытка
			ЭтотОбъект.TrayIcon.BalloonTipTitle = "Уведомление о ответе в тему!";
			ЭтотОбъект.TrayIcon.BalloonTipText 	= ДанныеСтроки.Ссылка.Наименование;
			ЭтотОбъект.TrayIcon.ShowBalloonTip(3000);
		Исключение
		КонецПопытки;
	КонецЕсли;

	Если ТекущийПользователь.ПоказыватьУведомления Тогда
		ФормаУв = ЭтотОбъект.ПолучитьФорму("Уведомления", , "Уведомления");
		Если НЕ ФормаУв.Открыта() Тогда
			ФормаУв.Открыть();
		КонецЕсли;
		ОтборУв = ФормаУв.ЗадачаСписок.Отбор.Пользователь;
		ОтборУв.Использование 	= Истина;
		ОтборУв.ВидСравнения 	= ВидСравнения.Равно;
		ОтборУв.Значение 		= ТекущийПользователь;
		ФормаУв.Активизировать();
	КонецЕсли;

КонецПроцедуры

Процедура НоваяТемаОбъекта(ОбъектСсылка, МетаданныеОбъекта) Экспорт
	
	ОткрытьФормуФорума();
	ФормаФорум.ОткрытьФормуНовойТемыОбъекта(ОбъектСсылка, МетаданныеОбъекта);
	
КонецПроцедуры

Процедура ИзменитьТекущуюТему(Форма) Экспорт
	
	СтрФайлТемы = Форма.ЭлементыФормы.ПолеHTMLДокумента1.Документ.URLUnencoded;
	
	Инд = Найти(СтрФайлТемы, "temptopik");
	СтрНомерТемы = "";
	Если Инд Тогда
		СтрНомерТемы = Прав(СтрФайлТемы, СтрДлина(СтрФайлТемы) - Инд - 8);
		Инд = Найти(СтрНомерТемы, ".");
		СтрНомерТемы = Лев(СтрНомерТемы, Инд - 1);
	Иначе
		Инд = Найти(СтрФайлТемы, "tempphorum");
		Если Инд Тогда
			СтрНомерТемы = Прав(СтрФайлТемы, СтрДлина(СтрФайлТемы) - Инд - 9);
			Инд = Найти(СтрНомерТемы, ".");
			СтрНомерТемы = Лев(СтрНомерТемы, Инд - 1);
		КонецЕсли;
	КонецЕсли;
	Если ЗначениеЗаполнено(СтрНомерТемы) Тогда
		НТема = Справочники.Форум.НайтиПоКоду(СтрНомерТемы);
		Если ЗначениеЗаполнено(НТема) Тогда
			ТекущаяТема = НТема;
			Форма.Тема = НТема;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры


HTMLПрилеплена =
"	<span style=""float:right"">
|<img class=""inlineimg"" src=""%КаталогФорума%files/sticky00.gif"" alt=""Важная тема"" /> 
|</span>
|<strong style=""font-size:0.9em"">Важно:</strong>";

HTMLРазделитель = "<tr><td class=""thead"" colspan=""7"">&nbsp;</td></tr>";
